In [1]:
pip install pandas

Collecting pandas
  Downloading pandas-1.0.1-cp37-cp37m-manylinux1_x86_64.whl (10.1 MB)
     |████████████████████████████████| 10.1 MB 3.3 MB/s eta 0:00:01
Collecting pytz>=2017.2
  Downloading pytz-2019.3-py2.py3-none-any.whl (509 kB)
     |████████████████████████████████| 509 kB 64.0 MB/s eta 0:00:01
Collecting numpy>=1.13.3
  Downloading numpy-1.18.1-cp37-cp37m-manylinux1_x86_64.whl (20.1 MB)
     |████████████████████████████████| 20.1 MB 65.4 MB/s eta 0:00:01
Requirement already satisfied: python-dateutil>=2.6.1 in /srv/conda/envs/notebook/lib/python3.7/site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in /srv/conda/envs/notebook/lib/python3.7/site-packages (from python-dateutil>=2.6.1->pandas) (1.14.0)
Installing collected packages: pytz, numpy, pandas
Successfully installed numpy-1.18.1 pandas-1.0.1 pytz-2019.3
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd
import json

In [3]:
ls

'Ejemplo 1.ipynb'  'Ejemplo 2.ipynb'

In [4]:
cd ..

/home/jovyan/Bloque 3/Sesion 3

## 1 Leer Json

### 1.1 Un nivel de jerarquía

In [5]:
with open('Data/multiple-records.json', 'r') as f:
    multiple_json = json.load(f)

In [6]:
multiple_json

{'users': [{'userId': 1,
   'firstName': 'Krish',
   'lastName': 'Lee',
   'phoneNumber': '123456',
   'emailAddress': 'krish.lee@learningcontainer.com'},
  {'userId': 2,
   'firstName': 'racks',
   'lastName': 'jacson',
   'phoneNumber': '123456',
   'emailAddress': 'racks.jacson@learningcontainer.com'},
  {'userId': 3,
   'firstName': 'denial',
   'lastName': 'roast',
   'phoneNumber': '33333333',
   'emailAddress': 'denial.roast@learningcontainer.com'},
  {'userId': 4,
   'firstName': 'devid',
   'lastName': 'neo',
   'phoneNumber': '222222222',
   'emailAddress': 'devid.neo@learningcontainer.com'},
  {'userId': 5,
   'firstName': 'jone',
   'lastName': 'mac',
   'phoneNumber': '111111111',
   'emailAddress': 'jone.mac@learningcontainer.com'}]}

In [7]:
multiple_records = pd.read_json("Data/multiple-records.json")

In [8]:
multiple_records

                                               users
0  {'userId': 1, 'firstName': 'Krish', 'lastName'...
1  {'userId': 2, 'firstName': 'racks', 'lastName'...
2  {'userId': 3, 'firstName': 'denial', 'lastName...
3  {'userId': 4, 'firstName': 'devid', 'lastName'...
4  {'userId': 5, 'firstName': 'jone', 'lastName':...

In [9]:
multiple_records["users"]

0    {'userId': 1, 'firstName': 'Krish', 'lastName'...
1    {'userId': 2, 'firstName': 'racks', 'lastName'...
2    {'userId': 3, 'firstName': 'denial', 'lastName...
3    {'userId': 4, 'firstName': 'devid', 'lastName'...
4    {'userId': 5, 'firstName': 'jone', 'lastName':...
Name: users, dtype: object

In [23]:
multiple_records["users"][0]

{'userId': 1,
 'firstName': 'Krish',
 'lastName': 'Lee',
 'phoneNumber': '123456',
 'emailAddress': 'krish.lee@learningcontainer.com'}

In [26]:
pd.DataFrame(multiple_records["users"][0], index = [0])

   userId firstName lastName phoneNumber                     emailAddress
0       1     Krish      Lee      123456  krish.lee@learningcontainer.com

In [10]:
pd.json_normalize(multiple_records["users"])

   userId firstName lastName phoneNumber                        emailAddress
0       1     Krish      Lee      123456     krish.lee@learningcontainer.com
1       2     racks   jacson      123456  racks.jacson@learningcontainer.com
2       3    denial    roast    33333333  denial.roast@learningcontainer.com
3       4     devid      neo   222222222     devid.neo@learningcontainer.com
4       5      jone      mac   111111111      jone.mac@learningcontainer.com

### 1.2 Varios niveles de jerarquía

#### 1.2.1 Ejemplo 1

In [12]:
with open('Data/user_data.json', 'r') as f:
    user_data = json.load(f)

In [13]:
user_data

{'users': [{'firstName': 'Sonoo',
   'lastName': 'Jaiswal',
   'age': 27,
   'address': {'streetAddress': 'Plot-6, Mohan Nagar',
    'city': 'Ghaziabad',
    'state': 'UP',
    'postalCode': '201007'}},
  {'firstName': 'Jhon',
   'lastName': 'Rick',
   'age': 25,
   'address': {'streetAddress': 'Colon',
    'city': 'San Francisco',
    'state': 'CA',
    'postalCode': '201043'}}]}

In [15]:
read_json_user_data = pd.read_json("Data/user_data.json")

In [16]:
read_json_user_data["users"]

0    {'firstName': 'Sonoo', 'lastName': 'Jaiswal', ...
1    {'firstName': 'Jhon', 'lastName': 'Rick', 'age...
Name: users, dtype: object

In [17]:
pd.json_normalize(read_json_user_data["users"])

,firstName,lastName,age,address.streetAddress,address.city,address.state,address.postalCode
0,Sonoo,Jaiswal,27,"Plot-6, Mohan Nagar",Ghaziabad,UP,201007
1,Jhon,Rick,25,Colon,San Francisco,CA,201043

#### 1.2.1 Ejemplo 2

In [18]:
data = [{'state': 'Florida',
         'shortname': 'FL',
         'info': {'governor': 'Rick Scott'},
         'counties': [{'name': 'Dade', 'population': 12345},
                      {'name': 'Broward', 'population': 40000},
                      {'name': 'Palm Beach', 'population': 60000}]},
        {'state': 'Ohio',
         'shortname': 'OH',
         'info': {'governor': 'John Kasich'},
         'counties': [{'name': 'Summit', 'population': 1234},
                      {'name': 'Cuyahoga', 'population': 1337}]}]

In [19]:
data

[{'state': 'Florida',
  'shortname': 'FL',
  'info': {'governor': 'Rick Scott'},
  'counties': [{'name': 'Dade', 'population': 12345},
   {'name': 'Broward', 'population': 40000},
   {'name': 'Palm Beach', 'population': 60000}]},
 {'state': 'Ohio',
  'shortname': 'OH',
  'info': {'governor': 'John Kasich'},
  'counties': [{'name': 'Summit', 'population': 1234},
   {'name': 'Cuyahoga', 'population': 1337}]}]

In [20]:
pd.json_normalize(data)

,state,shortname,counties,info.governor
0,Florida,FL,"[{'name': 'Dade', 'population': 12345}, {'name...",Rick Scott
1,Ohio,OH,"[{'name': 'Summit', 'population': 1234}, {'nam...",John Kasich

In [21]:
result = pd.json_normalize(data, 'counties', ['state', 'shortname',
                                           ['info', 'governor']])

In [22]:
result

         name  population    state shortname info.governor
0        Dade       12345  Florida        FL    Rick Scott
1     Broward       40000  Florida        FL    Rick Scott
2  Palm Beach       60000  Florida        FL    Rick Scott
3      Summit        1234     Ohio        OH   John Kasich
4    Cuyahoga        1337     Ohio        OH   John Kasich